&Пластилин
Перем ХранилищеСущностейПакет;

&Лог
Перем Лог;

// TODO: Сервис не должен возвращать сущность, а должен возвращать DTO
Функция ПолучитьПакеты() Экспорт
	Пакет = ХранилищеСущностейПакет.ПолучитьОдно();
	Лог.Информация("Пакет найден: %1", Пакет <> Неопределено);
	Если Пакет = Неопределено Тогда
		Пакет = ХранилищеСущностейПакет.СоздатьЭлемент();
		Пакет.Код = "autumn";
		Пакет.Название = "autumn";
		Пакет.АктуальнаяВерсия = "4.3.11";
		Пакет.СсылкаНаПроект = "https://github.com/autumn-library/autumn";
		
		Пакет.Сохранить();
	КонецЕсли;

	Результат = Новый Массив();
	Результат.Добавить(Пакет);

	Возврат Результат;

КонецФункции

&Желудь
Процедура ПриСозданииОбъекта()
КонецПроцедуры
