&Пластилин
Перем ХранилищеСущностейПакет;

&Лог
Перем Лог;

// TODO: Сервис не должен возвращать сущность, а должен возвращать DTO
Функция ПолучитьПакеты() Экспорт
	Пакеты = ХранилищеСущностейПакет.Получить();
	Лог.Информация("Пакеты найдены: %1", Пакеты.Количество() > 0);
	Если Пакеты.Количество() = 0 Тогда
		Пакет = ХранилищеСущностейПакет.СоздатьЭлемент();
		Пакет.Код = "autumn";
		Пакет.Название = "autumn";
		Пакет.АктуальнаяВерсия = "4.3.11";
		Пакет.СсылкаНаПроект = "https://github.com/autumn-library/autumn";
		
		Пакет.Сохранить();

		Пакеты.Добавить(Пакет);
	КонецЕсли;

	Результат = Новый Массив;

	Для Каждого Пакет Из Пакеты Цикл
		Результат.Добавить(Пакет);
	КонецЦикла;

	Возврат Результат;

КонецФункции

&Желудь
Процедура ПриСозданииОбъекта()
КонецПроцедуры
