#Использовать fzy

&Пластилин
Перем ХранилищеСущностейПакет;

&Лог
Перем Лог;

Функция ПолучитьПакеты() Экспорт
	
	Пакеты = Пакеты();

	Результат = Новый Массив;

	Для Каждого Пакет Из Пакеты Цикл
		
		ДанныеПакета = ДанныеПакетаИзМодели(Пакет);

		Результат.Добавить(ДанныеПакета);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПолучитьПакетыСОтбором(ТекстОтбора = "") Экспорт
	Если НЕ ЗначениеЗаполнено(ТекстОтбора) Тогда
		Возврат ПолучитьПакеты();
	КонецЕсли;

	Пакеты = Пакеты();

	Результат = Новый Массив;

	ТаблицаПакетов = ТаблицаПакетов(Пакеты);

	Поиск = Новый Поиск(ТаблицаПакетов);

	РезультатыПоиска = Поиск.НайтиЗначенияИлиКлючи(ТекстОтбора, 0, Истина);

	Для Каждого РезультатПоиска Из РезультатыПоиска Цикл
		Результат.Добавить(РезультатПоиска.Ссылка);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ТаблицаПакетов(Пакеты)

	ТаблицаПакетов = Новый ТаблицаЗначений();
	ТаблицаПакетов.Колонки.Добавить("ИмяПакета");
	ТаблицаПакетов.Колонки.Добавить("Версия");
	ТаблицаПакетов.Колонки.Добавить("Описание");
	ТаблицаПакетов.Колонки.Добавить("Ссылка");

	Для Каждого Пакет Из Пакеты Цикл
		
		ДанныеПакета = ДанныеПакетаИзМодели(Пакет);

		НоваяСтрока = ТаблицаПакетов.Добавить();
		НоваяСтрока.Ссылка = ДанныеПакета;
		НоваяСтрока.ИмяПакета = ДанныеПакета.ИмяПакета;
		НоваяСтрока.Версия = ДанныеПакета.Версия;
		НоваяСтрока.Описание = ДанныеПакета.Описание;

	КонецЦикла;

	Возврат ТаблицаПакетов;
	
КонецФункции

Функция Пакеты()
	Пакеты = ХранилищеСущностейПакет.Получить();
	
	Лог.Информация("Пакеты найдены: %1", Пакеты.Количество() > 0);
	
	// Отладочный блок
	Если Пакеты.Количество() = 0 Тогда
		Пакет = ХранилищеСущностейПакет.СоздатьЭлемент();
		Пакет.Код = "autumn";
		Пакет.Название = "autumn";
		Пакет.АктуальнаяВерсия = "4.3.11";
		Пакет.СсылкаНаПроект = "https://github.com/autumn-library/autumn";
		
		Пакет.Сохранить();

		Пакеты.Добавить(Пакет);

		Пакет = ХранилищеСущностейПакет.СоздатьЭлемент();
		Пакет.Код = "winow";
		Пакет.Название = "winow";
		Пакет.АктуальнаяВерсия = "1.0.1";
		Пакет.СсылкаНаПроект = "https://github.com/oscript-library/winow";
		
		Пакет.Сохранить();

		Пакеты.Добавить(Пакет);
	КонецЕсли;

	Возврат Пакеты;
КонецФункции

Функция ДанныеПакетаИзМодели(Пакет)
	ДанныеПакета = Новый ДанныеПакета;

	ДанныеПакета.ИмяПакета = Пакет.Название;
	ДанныеПакета.Версия = Пакет.АктуальнаяВерсия;
	ДанныеПакета.ДомашнаяСтраница = Пакет.СсылкаНаПроект;
	ДанныеПакета.Описание = Пакет.Описание;

	Возврат ДанныеПакета;
КонецФункции

&Желудь
Процедура ПриСозданииОбъекта()
КонецПроцедуры
