&Пластилин
Перем ХранилищеСущностейПакет;

&Лог
Перем Лог;

Функция ПолучитьПакеты() Экспорт
	Пакеты = ХранилищеСущностейПакет.Получить();
	
	Лог.Информация("Пакеты найдены: %1", Пакеты.Количество() > 0);
	
	// Отладочный блок
	Если Пакеты.Количество() = 0 Тогда
		Пакет = ХранилищеСущностейПакет.СоздатьЭлемент();
		Пакет.Код = "autumn";
		Пакет.Название = "autumn";
		Пакет.АктуальнаяВерсия = "4.3.11";
		Пакет.СсылкаНаПроект = "https://github.com/autumn-library/autumn";
		
		Пакет.Сохранить();

		Пакеты.Добавить(Пакет);
	КонецЕсли;

	Результат = Новый Массив;

	Для Каждого Пакет Из Пакеты Цикл
		ДанныеПакета = Новый ДанныеПакета;

		ДанныеПакета.ИмяПакета = Пакет.Название;
		ДанныеПакета.Версия = Пакет.АктуальнаяВерсия;
		ДанныеПакета.ДомашнаяСтраница = Пакет.СсылкаНаПроект;

		Результат.Добавить(ДанныеПакета);
	КонецЦикла;

	Возврат Результат;

КонецФункции

&Желудь
Процедура ПриСозданииОбъекта()
КонецПроцедуры
