#Использовать annotations

&Лог
Перем Лог;

Перем Рефлектор;

Функция Сериализовать(Объект) Экспорт
	ОбъектСериализации = ПреобразоватьОбъектСериализации(Объект);

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, ОбъектСериализации);

	Возврат Запись.Закрыть();
КонецФункции

Функция ПреобразоватьОбъектСериализации(Объект)
	ПримитивныеТипы = Новый Массив;
	ПримитивныеТипы.Добавить(Тип("Строка"));

	Лог.Информация("Попытка сериализации %1, тип %2", Объект, ТипЗнч(Объект));

	Если Объект = Неопределено Тогда
		Результат = Неопределено;
	// Массив
	ИначеЕсли ТипЗнч(Объект) = Тип("Массив") Тогда
		Результат = Новый Массив;

		Для Каждого Элемент Из Объект Цикл
			ПреобразованныйЭлемент = ПреобразоватьОбъектСериализации(Элемент);
			Результат.Добавить(ПреобразованныйЭлемент);
		КонецЦикла;
	// Структура
	ИначеЕсли ТипЗнч(Объект) = Тип("Структура") Тогда
		Результат = Новый Структура;

		Для Каждого Элемент Из Объект Цикл
			ПреобразованноеЗначение = ПреобразоватьОбъектСериализации(Элемент.Значение);
			Результат.Вставить(Элемент.Ключ, ПреобразованноеЗначение);
		КонецЦикла;
	// Примитивные типы
	ИначеЕсли ПримитивныеТипы.Найти(ТипЗнч(Объект)) <> Неопределено Тогда
		Результат = Строка(Объект);
	// Сценарии?
	Иначе
		СвойстваОбъекта = Рефлектор.ПолучитьТаблицуСвойств(Объект);
		Методы = Рефлектор.ПолучитьТаблицуМетодов(Объект);
		ЭтоСериализуемое = РаботаСАннотациями.НайтиМетодыСАннотацией(Методы, "Сериализуемое").Количество() > 0;

		Если ЭтоСериализуемое Тогда
			Результат = Новый Структура;

			Для Каждого СвойствоОбъекта Из СвойстваОбъекта Цикл
				ИмяСвойства = СвойствоОбъекта.Имя;
				JsonСвойство = РаботаСАннотациями.НайтиАннотацию(СвойствоОбъекта.Аннотации, "JsonСвойство");
				Если JsonСвойство <> Неопределено Тогда
					ИмяСвойства = РаботаСАннотациями.ПолучитьЗначениеПараметраАннотации(JsonСвойство);
				КонецЕсли;
				
				ЗначениеСвойства = Рефлектор.ПолучитьСвойство(Объект, СвойствоОбъекта.Имя);
				ЗначениеСвойства = ПреобразоватьОбъектСериализации(ЗначениеСвойства);
				Результат.Вставить(ИмяСвойства, ЗначениеСвойства);
			КонецЦикла;
		Иначе
			Лог.Предупреждение("Неизвестный тип объекта для преобразования: %1", ТипЗнч(Объект));
			Результат = Неопределено;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;
КонецФункции

&Желудь
Процедура ПриСозданииОбъекта()
	Рефлектор = Новый Рефлектор();
КонецПроцедуры