

&Контроллер("/")
&Отображение(Шаблон = "./view/homeLayout.html", Метод = "ПолучитьМодельКонтрола")
Процедура ПриСозданииОбъекта()

КонецПроцедуры

Функция ПолучитьМодельКонтрола(Запрос) Экспорт
	
	МодельКонтрола = МодельОтображенияКонтрола();
	МодельКонтрола.ЭтоСтраницаПакеты = СтрНайти(Запрос.Путь, "packages") > 0;

	Возврат МодельКонтрола;
КонецФункции

&ТочкаМаршрута("")
&Отображение("./view/homePage.html")
Процедура Главная() Экспорт

КонецПроцедуры

&ТочкаМаршрута("packages")
&Отображение("./view/packagesPage.html")
Процедура Пакеты() Экспорт

КонецПроцедуры

Функция МодельОтображенияКонтрола()

	МодельКонтрола = Новый Структура();
	МодельКонтрола.Вставить("ЭтоСтраницаПакеты", Ложь);

	Возврат МодельКонтрола;

КонецФункции