&Пластилин
Перем ПакетыСервис;

&Лог
Перем Лог;

&Контроллер("/")
&Отображение(Шаблон = "./view/homeLayout.html", Метод = "ПолучитьМодельКонтрола")
Процедура ПриСозданииОбъекта()

КонецПроцедуры

Функция ПолучитьМодельКонтрола(Запрос) Экспорт
	
	МодельКонтрола = МодельОтображенияКонтрола();
	МодельКонтрола.ЭтоСтраницаПакеты = СтрНайти(Запрос.Путь, "packages") > 0;

	Лог.Информация("ЭтоСтраницаПакеты: %1", МодельКонтрола.ЭтоСтраницаПакеты);

	Если МодельКонтрола.ЭтоСтраницаПакеты Тогда
		Пакеты = ПакетыСервис.ПолучитьПакеты();

		Для Каждого Пакет Из Пакеты Цикл
			МодельПакет = Новый Структура();
			МодельПакет.Вставить("Название", Пакет.Название);
			МодельПакет.Вставить("АктуальнаяВерсия", Пакет.АктуальнаяВерсия);
			МодельПакет.Вставить("АдресРепозитория", Пакет.СсылкаНаПроект);
			
			МодельКонтрола.Пакеты.Добавить(МодельПакет);
		КонецЦикла;
	КонецЕсли;

	Возврат МодельКонтрола;
КонецФункции

&ТочкаМаршрута("")
&Отображение("./view/homePage.html")
Процедура Главная() Экспорт

КонецПроцедуры

&ТочкаМаршрута("packages")
&Отображение("./view/packagesPage.html")
Процедура Пакеты(Запрос, Ответ) Экспорт
	Ответ.Модель = ПолучитьМодельКонтрола(Запрос);
КонецПроцедуры

Функция МодельОтображенияКонтрола()

	МодельКонтрола = Новый Структура();
	МодельКонтрола.Вставить("ЭтоСтраницаПакеты", Ложь);
	МодельКонтрола.Вставить("Пакеты", Новый Массив);

	Возврат МодельКонтрола;

КонецФункции