&Пластилин
Перем ПакетыСервис;

&Лог
Перем Лог;

&Контроллер("/")
&Отображение(Шаблон = "./view/homeLayout.html", Метод = "ПолучитьМодельКонтрола")
Процедура ПриСозданииОбъекта()

КонецПроцедуры

Функция ПолучитьМодельКонтрола(Запрос) Экспорт
	Возврат 1;
КонецФункции

&ТочкаМаршрута("")
&Отображение("./view/homePage.html")
Процедура Главная() Экспорт

КонецПроцедуры

Функция МодельОтображенияКонтрола()

	МодельКонтрола = Новый Структура();
	МодельКонтрола.Вставить("ЭтоСтраницаПакеты", Ложь);

	Возврат МодельКонтрола;

КонецФункции