&Пластилин
Перем ПакетыСервис;

&Лог
Перем Лог;

&Контроллер("/packages")
&Отображение(Шаблон = "./view/packagesLayout.html", Метод = "ПолучитьМодельКонтрола")
Процедура ПриСозданииОбъекта()

КонецПроцедуры

Функция ПолучитьМодельКонтрола(Запрос) Экспорт
	
	МодельКонтрола = МодельОтображенияКонтрола();
	МодельКонтрола.ЭтоСтраницаПакеты = Истина;

	Возврат МодельКонтрола;
КонецФункции

&ТочкаМаршрута("")
&Отображение("./view/packagesPage.html")
Процедура Пакеты(Ответ, text) Экспорт

	МодельКонтрола = Новый Структура("Пакеты", Новый Массив);
	
	Пакеты = ПакетыСервис.ПолучитьПакетыСОтбором(text);

	Для Каждого Пакет Из Пакеты Цикл
		МодельПакет = Новый Структура();
		МодельПакет.Вставить("Название", Пакет.ИмяПакета);
		МодельПакет.Вставить("АктуальнаяВерсия", Пакет.Версия);
		МодельПакет.Вставить("АдресРепозитория", Пакет.ДомашнаяСтраница);
		
		МодельКонтрола.Пакеты.Добавить(МодельПакет);
	КонецЦикла;

	Ответ.Модель = МодельКонтрола;
КонецПроцедуры

Функция МодельОтображенияКонтрола()

	МодельКонтрола = Новый Структура();
	МодельКонтрола.Вставить("ЭтоСтраницаПакеты", Ложь);

	Возврат МодельКонтрола;

КонецФункции