&Пластилин
Перем ПакетыСервис;

&Лог
Перем Лог;

&Контроллер("/")
&Отображение(Шаблон = "./view/homeLayout.html", Метод = "ПолучитьМодельКонтрола")
Процедура ПриСозданииОбъекта()

КонецПроцедуры

Функция ПолучитьМодельКонтрола(Запрос) Экспорт
	Возврат Неопределено;
КонецФункции

&ТочкаМаршрута("{ИмяПакета}")
&Отображение("./view/packageDetails.html")
Процедура СтраницаПакета(Ответ, ИмяПакета) Экспорт
	Ответ.Модель = Новый Структура("Пакет", Новый ДанныеПакета);
	Сообщить(ИмяПакета);
КонецПроцедуры