// BSLLS:ExportVariables-off

&JsonСвойство("name")
Перем ИмяПакета Экспорт;

&JsonСвойство("version")
Перем Версия Экспорт;

&JsonСвойство("description")
Перем Описание Экспорт;

&JsonСвойство("envVersion")
Перем ВерсияСреды Экспорт;

&JsonСвойство("availableVersions")
Перем ДоступныеВерсии Экспорт;

&JsonСвойство("homePage")
Перем ДомашнаяСтраница Экспорт;

&JsonСвойство("dependencies")
Перем Зависимости Экспорт;

&JsonСвойство("devDependencies")
Перем ЗависимостиРазработчика Экспорт;

&JsonСвойство("snapshot")
Перем ТестоваяСборка Экспорт;

&JsonСвойство("lastUpdated")
Перем ДатаОбновления Экспорт;

&Сериализуемое
Процедура ПриСозданииОбъекта()
КонецПроцедуры